<?php

/*
 * UserFrosting (http://www.userfrosting.com)
 *
 * @link      https://github.com/userfrosting/UserFrosting
 * @copyright Copyright (c) 2019 Alexander Weissman
 * @license   https://github.com/userfrosting/UserFrosting/blob/master/LICENSE.md (MIT License)
 */

return [
    'ACTIVITY' => [
        1 => 'Δραστηριότητα',
        2 => 'Δραστηριότητες',

        'LAST' => 'Τελευταία δραστηριότητα',
        'PAGE' => 'Λίστα δραστηριοτήτων των χρηστών',
        'TIME' => 'Χρόνος δραστηριότητας',
    ],

    'CACHE' => [
        'CLEAR'             => 'Διαγραφή της προσωρινής μνήμης',
        'CLEAR_CONFIRM'     => 'Είστε βέβαιοι ότι θέλετε να εκκαθαρίσετε την προσωρινή μνήμη του ιστότοπου;',
        'CLEAR_CONFIRM_YES' => 'Ναι, διαγραφή της προσωρινής μνήμης',
        'CLEARED'           => 'Η προσωρινή μνήμη διαγράφηκε με επιτυχία!',
    ],

    'DASHBOARD'             => 'Πίνακας ελέγχου',
    'NO_FEATURES_YET'       => 'Δεν φαίνεται να έχει ρυθμιστεί καμία λειτουργία για αυτόν τον λογαριασμό ... ακόμα. ίσως δεν έχουν υλοποιηθεί ακόμη, ή ίσως κάποιος να ξέχασε να σας δώσει πρόσβαση. Χαιρόμαστε πάντως που είσαι μαζί μας! ',
    'DELETE_MASTER'         => 'Δεν μπορείτε να διαγράψετε τον κύριο λογαριασμό!',
    'DELETION_SUCCESSFUL'   => 'Ο χρήστης <strong>{{user_name}}</strong> διαγράφηκε.',
    'DETAILS_UPDATED'       => 'Ενημέρωθηκαν οι πληροφορίες λογαριασμού για τον χρήστη <strong>{{user_name}}</strong>',
    'DISABLE_MASTER'        => 'Δεν μπορείτε να απενεργοποιήσετε τον κύριο λογαριασμό!',
    'DISABLE_SELF'          => 'Δεν μπορείτε να απενεργοποιήσετε τον δικό σας λογαριασμό!',
    'DISABLE_SUCCESSFUL'    => 'Ο λογαριασμός του χρήστη <strong>{{user_name}}</strong> απενεργοποιήθηκε.',

    'ENABLE_SUCCESSFUL' => 'Ο λογαριασμός του χρήστη <strong>{{user_name}}</strong> ενεργοποιήθηκε.',

    'GROUP' => [
        1 => 'Ομάδα',
        2 => 'Ομάδες',

        'CREATE'              => 'Δημιουργία ομάδας',
        'CREATION_SUCCESSFUL' => 'Η ομάδα <strong>{{name}} δημιουργήθηκε</strong>',
        'DELETE'              => 'Διαγραφή ομάδας',
        'DELETE_CONFIRM'      => 'Είστε βέβαιοι ότι θέλετε να διαγράψετε την ομάδα <strong>{{name}}</strong>?',
        'DELETE_DEFAULT'      => 'Δεν μπορείτε να διαγράψετε την ομάδα <strong>{{name}}</strong> επειδή είναι η προεπιλεγμένη ομάδα για τους νεοεισερχόμενους χρήστες.',
        'DELETE_YES'          => 'Ναι, διαγραφή ομάδας',
        'DELETION_SUCCESSFUL' => 'Η ομάδα <strong>{{name}}</strong> διαγράφηκε',
        'EDIT'                => 'Επεξεργασία ομάδας',
        'ICON'                => 'Εικονίδιο ομάδας',
        'ICON_EXPLAIN'        => 'Εικονίδιο για τα μέλη της ομάδας',
        'INFO_PAGE'           => 'Σελίδα πληροφοριών για την ομάδα {{name}}',
        'MANAGE'              => 'Διαχείριση ομάδας',
        'NAME'                => 'Όνομα ομάδας',
        'NAME_EXPLAIN'        => 'Παρακαλώ εισάγετε ένα όνομα για την ομάδα',
        'NOT_EMPTY'           => 'Δεν μπορείτε να το κάνετε αυτό επειδή εξακολουθούν να υπάρχουν χρήστες που είναι μέλη της ομάδας <strong>{{name}}</strong>.',
        'PAGE_DESCRIPTION'    => 'Λίστα των ομάδων του ιστότοπού σας. Παρέχει εργαλεία διαχείρισης για την επεξεργασία και τη διαγραφή ομάδων.',
        'SUMMARY'             => 'Σύνοψη ομάδας',
        'UPDATE'              => 'Ενημερώθηκαν οι λεπτομέρειες της ομάδας <strong>{{name}}</strong>',
    ],

    'MANUALLY_ACTIVATED'    => "Ο λογαριασμός του {{user_name}}'s ενεργοποίηθηκε χειροκίνητα",
    'MASTER_ACCOUNT_EXISTS' => 'Υπάρχει ήδη ο κύριος λογαριασμός!',
    'MIGRATION'             => [
        'REQUIRED'          => 'Απαιτείται ενημέρωση της βάσης δεδομένων',
    ],

    'PERMISSION' => [
        1 => 'Δικαίωμα',
        2 => 'Δικαιώματα',

        'ASSIGN_NEW'        => 'Αντιστοίχιση νέου δικαιώματος',
        'HOOK_CONDITION'    => 'Hook/Conditions',
        'ID'                => 'ID δικαιώματος',
        'INFO_PAGE'         => "Πληροφορίες δικαιώματων για '{{name}}'",
        'MANAGE'            => 'Διαχείριση δικαιώματων',
        'NOTE_READ_ONLY'    => '<strong>Σημείωση:</strong> Τα δικαιώματα θεωρούνται ως "κομμάτι του κώδικα" και δεν μπορούν να τροποποιηθούν για το interface.  Για να προσθέσετε, αφαιρέσετε, ή τροποποιήσετε δικαιώματα , θα πρέπει οι δημιουργοί του ιστότοπου να ακολουθήσουν την διαδικασία  <a href="https://learn.userfrosting.com/database/extending-the-database" target="about:_blank">database migration.</a>',
        'PAGE_DESCRIPTION'  => 'Λίστα δικαιωμάτων για τον ιστότοπό σας. Παρέχει εργαλεία διαχείρισης για την επεξεργασία και τη διαγραφή των δικαιωμάτων',
        'SUMMARY'           => 'Περίληψη δικαιωμάτος',
        'UPDATE'            => 'Ενημέρωση δικαιωμάτων',
        'VIA_ROLES'         => 'Έχει άδεια βάσει ρόλου',
    ],

    'ROLE' => [
        1 => 'Ρόλος',
        2 => 'Ρόλοι',

        'ASSIGN_NEW'          => 'Ανάθεση νέου ρόλου',
        'CREATE'              => 'Δημιουργία ρόλου',
        'CREATION_SUCCESSFUL' => 'Επιτυχής δημιουργία ρόλου <strong>{{name}}</strong>',
        'DELETE'              => 'Διαγραφή ρόλου',
        'DELETE_CONFIRM'      => 'Είστε βέβαιοι ότι θέλετε να διαγράψετε το ρόλο <strong>{{name}}</strong>?',
        'DELETE_DEFAULT'      => 'Δεν μπορείτε να διαγράψετε το ρόλο <strong>{{name}}</strong> επειδή είναι ένας προεπιλεγμένος ρόλος για τους νέους χρήστες.',
        'DELETE_YES'          => 'Ναι, διαγραφή ρόλου',
        'DELETION_SUCCESSFUL' => 'Ο ρόλος <strong>{{name}}</strong> διαγράφηκε',
        'EDIT'                => 'Επεξεργασία ρόλου',
        'HAS_USERS'           => 'Δεν μπορείτε να το κάνετε επειδή υπάρχουν ακόμα χρήστες που έχουν τον ρόλο <strong>{{name}}</strong>.',
        'INFO_PAGE'           => 'Σελίδα πληροφοριών του ρόλου {{name}}',
        'MANAGE'              => 'Διαχείριση ρόλου',
        'NAME'                => 'Όνομα',
        'NAME_EXPLAIN'        => 'Παρακαλώ εισάγετε ένα όνομα για το ρόλο',
        'NAME_IN_USE'         => 'Υπάρχει ήδη ρόλος με όνομα <strong>{{name}}</strong>',
        'PAGE_DESCRIPTION'    => 'Λίστα των ρόλων για τον ιστότοπό σας.Παρέχει εργαλεία διαχείρισης για επεξεργασία και διαγραφή ρόλων.',
        'PERMISSIONS_UPDATED' => 'Τα δικαιώματα ενημερώθηκαν για τον ρόλο <strong>{{name}}</strong>',
        'SUMMARY'             => 'Περίληψη ρόλου',
        'UPDATED'             => 'Οι λεπτομέρειες του ρόλου <strong>{{name}}</strong> ενημερώθηκαν',
    ],

    'SYSTEM_INFO' => [
        '@TRANSLATION' => 'Πληροφορίες συστήματος',

        'DB_NAME'     => 'Όνομα βάσης δεδομένων',
        'DB_VERSION'  => 'Έκδοση βάσης δεδομένων',
        'DIRECTORY'   => 'Κατάλογος project',
        'PHP_VERSION' => 'Έκδοση PHP',
        'SERVER'      => 'Λογισμικό διακομιστή Web',
        'SPRINKLES'   => 'Φορτωμένα sprinkles',
        'UF_VERSION'  => 'Έκδοση UserFrosting',
        'URL'         => 'Ριζικό URL ιστότοπου',
    ],

    'TOGGLE_COLUMNS' => 'Εναλλαγή στηλών',

    'USER' => [
        1 => 'Χρήστης',
        2 => 'Χρήστες',

        'ADMIN' => [
            'CHANGE_PASSWORD'    => 'Αλλαγή κωδικού χρήστη',
            'SEND_PASSWORD_LINK' => 'Αποστολή στον χρήστη ενός συνδέσμου που θα του επιτρέψει να επιλέξει κωδικό πρόσβασης',
            'SET_PASSWORD'       => 'Ορίστε τον κωδικό πρόσβασης του χρήστη ως',
        ],

        'ACTIVATE'          => 'Ενεργοποίηση χρήστη',
        'CREATE'            => 'Δημιουργία χρήστη',
        'CREATED'           => 'Ο χρήστης <strong>{{user_name}}</strong> δημιουργήθηκε',
        'DELETE'            => 'Διαγραφή χρήστη',
        'DELETE_CONFIRM'    => 'Είστε βέβαιοι ότι θέλετε να διαγράψετε τον χρήστη <strong>{{name}}</strong>?',
        'DELETE_YES'        => 'Ναι, διαγραφή χρήστη',
        'DELETED'           => 'Ο χρήστης διαγράφηκε',
        'DISABLE'           => 'Απενεργοποίηση χρήστη',
        'EDIT'              => 'Επεξεργασία χρήστη',
        'ENABLE'            => 'Ενεργοποίηση χρήστη',
        'INFO_PAGE'         => 'Σελίδα πληροφοριών για τον χρήστη {{name}}',
        'LATEST'            => 'Πρόσφατοι χρήστες',
        'PAGE_DESCRIPTION'  => 'Λίστα χρηστών για τον ιστότοπό σας.Παρέχει εργαλεία διαχείρισης, συμπεριλαμβανομένης της δυνατότητας επεξεργασίας λεπτομερειών χρηστών, χειροκίνητης ενεργοποίησης χρηστών, ενεργοποίησης / απενεργοποίησης χρηστών και πολλών άλλων.',
        'SUMMARY'           => 'Περίληψη λογαριασμού',
        'VIEW_ALL'          => 'Προβολή όλων των χρηστών',
        'WITH_PERMISSION'   => 'Χρήστες με αυτό το δικαιώμα',
    ],
    'X_USER' => [
        0 => 'Κανένας χρήστης',
        1 => '{{plural}} χρήστης',
        2 => '{{plural}} χρήστες',
    ],
];
